
    [{
        "id": 1,
        "created": "10/08/2018",
        "headline": "Mon objectif changer pour devenir codeur à 50 ans",
        "summary": "Je me suis spécialisé. Tous les algorithmes et structures de données JavaScript ne sont pas cliqués pour moi. Au lieu d'abandonner, je me suis fait un chemin avec un codage créatif. J'ai appris le plus possible sur CSS, SVG et les animations. Ensuite, j'ai trouvé des entreprises à la recherche de ces spécialités.",
        "image": "img/IMG_20180925_191349-01.jpeg",
        "content": "<h1>Welcome to Thimble</h1> <p >La spécialisation est quelque chose que mon mentor m 'a conseillé dès le début.    Je suis encore en train d'apprendre le JavaScript.Pour moi, il n’ a pas encore cliqué.Malgré cela, je suis actuellement un \"développeur JavaScript\"pour une nouvelle entreprise. Je me suis spécialisé dans les animations CSS et à travailler avec le framework VUEJS.Faire des animations amusantes est maintenant mon travail et je fais presque 3 fois ce que je faisais lors de mon premier emploi.Ce que j 'ai fait m'a aidé à obtenir un emploi à distance: J 'ai travaillé sur de nombreux projets parallèles (en réalité, il s'agissait de petits stylos CodePen).J 'étais enthousiaste à leur sujet. J'ai partagé mes progrès avec d 'autres communautés telles que la communauté CodeNewbie et # 100daysofcode. C’était utile car j’avais beaucoup à parler lors de mon entretien avec la société qui m’avait confié mon premier emploi.J 'ai rejoint le groupe Chingu pour acquérir une expérience de travail avec une équipe distante avant de postuler à un poste distant.J 'ai postulé à des emplois avant même de connaître JavaScript.C '    était un gros pour moi.Je pensais que je ne serais pas un développeur front - end sans connaître le JavaScript au préalable.Mon mentor m 'a dit que je pourrais apprendre sur le tas si je pouvais convaincre quelqu'    un de m 'embaucher malgré mon manque de connaissances. J 'avais un plan de 2 ans pour obtenir un emploi de développeur. Parce qu'il m 'a poussé à postuler plus tôt, j'    ai trouvé un emploi après 9 mois d 'apprentissage du code. J'ai toujours précisé ce que je fais et ce que je ne sais pas dans les entretiens.Je leur dis que je suis disposé à apprendre tout ce dont l 'entreprise a besoin.    Communauté.J 'ai rejoint beaucoup de communautés pour obtenir du soutien et des conseils.FreeCodeCamp,CodeNewbies,100 jours de code,DailyCSSImages,ChinguCodePen.C’était quelques-unes des communautés initiales auxquelles j’ai eu recours.    Je me suis mis à mon compte en tant que freelance.(Cette partie ne plaît pas à beaucoup de gens, y compris moi - même).Je me suis inscrit à Twitter et j 'ai contacté des techniciens. J'    ai un compte LinkedIn et j 'ai commencé à me connecter avec des gens de l'industrie.J 'ai commencé un blog. J'ai partagé mon travail, même quand c 'était un travail en cours. Je me suis lancé et j'    ai accepté des invitations à faire des choses que je ne pensais pas pouvoir faire.(J 'ai créé un cours, j'étais sur un podcast, j 'ai postulé pour des conférences).     Je me suis spécialisé.Tous les algorithmes JavaScript et toutes les structures de données ne sont pas cliqués pour moi.Au lieu d 'abandonner, je me suis fait un chemin avec un codage créatif. J'            ai appris le plus possible sur CSS, et les animations.Ensuite, j 'ai trouvé des entreprises à la recherche de ces spécialités.            </p>"
    },
    {
        "id": 2,
        "created": "10/08/2018",
        "headline": "Avantage et inconvénient d'un site web sur mesure",
        "summary": "En construisant votre site avec un CMS type WordPress, Joomla ou encore Drupal (mais plus complexe) vous avez l’avantage d’utiliser des sites prêts à l’emploi, pour certain open source, téléchargeable sur internet, vous avez le choix de plusieurs template au visuel déjà prêt, facilitant la production.",
        "image": "img/sebastian-bednarek-624108-unsplash.jpg",
        "content": "<h1>1.Introduction</h1><p>En construisant votre site avec un CMS type WordPress, Joomla ou encore Drupal (mais plus complexe) vous avez l’avantage d’utiliser des sites prêts à l’emploi, pour certain open source, téléchargeable , vous avez le choix de plusieurs template au visuel déjà prêt, facilitant la production.</p><h1>2.CMS</h1><p>Les solutions CMS sont souvent intuitives comme un traitement de texte. Cependant, pas de miracle, vous risquez d’avoir le même site que votre concurrent, votre site ne sera pas original, car les templates sont ,si l’on peut dire ,partager et vendus plusieurs fois.</p><p>Vous êtes donc tributaire des choix graphiques et techniques de ces templates. Cependant, il est possible tout de même d’amener de l’originalité, mais il faudra faire l’effort de jouer avec le code ou de pousser ces compétences et techniques pour apporter des modifications nécessaires.</p><p>La création d’un site internet via CMS est souvent moins cher et les délais réduit, sauf si des fonctionnalités doivent être ajoutées personnalisant le CMS faisant s’envoler les chiffres.</p><p>De plus, les modifications sur un CMS peuvent être compliquées.En terme de sécurité ,il faut veiller régulièrement à la mise à jour de patch, et se poser la question qui prends en charge les dommages , les évolutions, les mise à jour,qui va suivre.</p><p>En terme de référencement naturel, il faut bien approfondir l’outil pour le paramétrer correctement, et la rapidité peut laisser parfois à désirer, quand on sait que ces deux paramètres influencent le rang dans Google, il faut en tenir compte.La rapidité est influencée par les modules surnuméraires liés au CMS (BDD, Zone Administration complexes et pas forcement personnalisable).</p><p>70 % des sites utilisent des CMS (30% Wordpress) apportant l’avantage d’une communauté active répondant à tous vosbesoins.Et depuis quelque temps, ils se sont diversifiés dans tous les domaines du Net , Blog à l’origine, ils se sont étendu vers la création de site multi-pages, multilingues, e commerce.Ces solutions sont équilibrées, mais manque d’évolutivité et sont rigides dès que l’on souhaite une évolution des fonctionnalités.</p><h1>3.Sur Mesure</h1><p>Un site sur-mesure sera codé de A à Z (« fait maison ») adapté à vos besoins et fonctionnalités, le design peut offrir toutes les innovations pour attirer de nouveau client, le sur-mesure est plus efficace, plus maniable et plus rapide,car il est pensé en amont pour un meilleur référencement.</p><p>En termes de sécurité, le code et le fonctionnement restent cachés et inconnus du public, ajoutant de la complexité au piratage.La maintenance des sites est plus facile, car nous avons la maîtrise de l’environnement des fichiers et du code.</p><p>Sur un site sur-mesure, l’implantation de fonctionnalité supplémentaire est indépendante, aménageable, maniable.</p><p>Le code est optimisé et ne charge que ce que vous avez besoin le rendant plus rapide.Il peut répondre à la derniere tendance utilisateur , multipages ,multilingues , e-commerce ,personnalisé pour votre entreprise mais peut répondre àd’autre problématique (sécurité optimale, liason CRM, ERP, complexifiés les droits d’accès,intranet etc..).</p><p>Le temps et donc l’argent pour proposer une solution au client peut s’avérer rédhibitoire, mais sur le long terme ...Un investissement, il peut améliorer votre notoriété car plus visible.</p><h1>4.Conculsion</h1><p>Dans tous les cas connaître les attentes et les besoins du client en profondeur déterminera le choix de la solution Merci de partager</br>sources :</br><a href=\"https://www.alphalives.com/agence-web-paris/technologies-agence-web/sur-mesure-vs-cms\">Le développement sur - mesure face aux CMS </a></br> <a href = \"http://www.access-com.fr/blog/nouvelles-technologies/cms-ou-developpement-specifique.html\" > Pour votre projet web: CMS ou développement spécifique ? </a></br> <a href = \"https://siecledigital.fr/2018/08/06/creation-dun-site-web-cms-ou-sur-mesure/\" > Création d’ un site web : CMS ou sur - mesure ? </a></p >"
    }]

